{"Id":"how-to-speak","Content":"I recently watched a great talk that changed how I think about communication. As a software engineer,  I always focused on writing code and improving my technical skills. But recently, I realized the importance of expressing your ideas with clarity. Whether you are writing or speaking. Effective communication is a skill that benefits everyone.\n\nHere is the link to the speech on YouTube: [https://youtu.be/Unzc731iCUY?si=Fk8FTklDsQa7GHLs](https://youtu.be/Unzc731iCUY?si=Fk8FTklDsQa7GHLs)\n\nThe following are the notes I wrote down so that I can return to read them when I need them.\n\nBefore jumping into the topic, I need to mention its importance. From the start, the speaker stressed a few key elements for success.\n\nThose are:\n- How to speak\n- How to write\n- The quality of the idea.\n\nAnd how to speak is the most crucial skill among these three.\nHe tried to formulate the quality of the speaking skills as a function.\n\nf( big K x semi-big P x small T)\n\nK stands for knowledge, P stands for practice, and T stands for talent.\n\nYou can already see that practice plays a significant role in this skill.\n\n### 1. How to Start\n\nSpeaking of how to start a speech or talk, many people consider telling a joke to open the speech. However, the speaker thinks this is a bad idea. The audience is still adjusting and not ready for your talk style. The joke will very likely fall flat.\n\nInstead, make a promise at the beginning of the talk. Tell the audience what they are going to learn in the following speech to give them a reason to stay.\n\n### 2. Samples\n\nThe speaker gave some samples we should adopt for the talk.\n\n- **Cycle**:\n\tAs the meaning of the cycle stands, you should repeat the topic several times during the speech. The reason is simple: people might get distracted during the talk. Repeatedly returning to the topic will lower the chance that they will miss it.\n\n- **Build the fence**:\n\tYou have to tell people, this is my idea! Make it clear so it stands out from others.\n\n- **Verbal punctuation**:\n\tProvide a good landmark so people can always get back to what you are talking about. For example, you should lay out the structure of the talk from the start. This helps people know where you are now.\n\n- **Ask a question**:\n\tYou have to choose the question carefully. It should not be too easy so people won't be afraid to answer it because it's too obvious, and it should not be too difficult because then no one will ever answer it.\n\n### 3. Time and Space\n\nThe speaker said that the time and place of the speech matter. For example, 11 AM is a very good choice for having a speech. This talk is a lecture at MIT, and at 11 AM, most people are already awake and unlikely to go back to sleep. Also, do not pick the time after lunch; people might feel sleepy.\n\nWhen choosing a venue, it is important to choose one that is well-lit and the right size. Ensure that the room is well-lit so that people do not feel drowsy.\n\nPeople should populate the room. We should make the space at least half full.\n\nAnother important thing is to case. You have to check the location before the speech. So that you have time to adjust and prepare for what will come, it's like a rehearsal.\n\n### 4. Board\n\nThis is also well demonstrated during the talk. The speaker uses the board and chalk most of the time during the lecture. (Besides the time he talked about the topic Slides)\n\nHe thinks the board is a better approach to informing the audience.\n\nChalk and board is a perfect way to inform because they consist of the following good quality:\n\n- **Graphic quality** - Drawing or writing by hand often makes things more straightforward.\n\n- **Speed** - You can control the speed with how fast you write things down. Unlike the slide, you might go through them too fast, and the audience does not have enough time to react. The speed of your writing is also the speed the audience can absorb.\n\n- **Target** - You can use your hand position to indicate where you are talking. Sometimes, it's unnecessary to relate to what you were talking about. This can prevent you from putting your hands in your pockets or the back.\n\n### 5. Props\n\nThe speaker uses examples to show the power of the props in the talk. I have to say, it's very impressive. Most of the time, we don't do it because we use the slides to assist the talk, and we put all the demos or examples in the slides. But in fact, the live props showing up during the talk can make a very strong impression on the audience. I still remember when Steve Jobs took out the first MacBook Air during the conference. That moment was unforgettable because it was a live demonstration, not just a slide.\n\nThe speaker describes points 4 and 5 as an advantage. They have a quality of Empathic Mirroring. It makes the audience feel like they are experiencing what the speaker is doing. This might be a good explanation of why people like live demos as well. Because you feel like you are using it and experiencing it at the same time.\n\n### 6. Slides\n\nAs mentioned earlier, using a board is a good way to inform. On the other hand, using a slide is a good way to expose the ideas. But there are a lot of common bad habits when people are making slides. That is why the speaker highlighted a couple of points that we need to keep in mind:\n\n- Do not put too many words.\n- The words should be easy to read.\n- Do not read the slides during the speech.\n- Stand on the same side as your slides so the audience doesn’t have to keep looking back and forth.\n- Get rid of the unnecessary logo.\n- Get rid of the unnecessary title.\n- Do not use a pointer or laser pointer; use an arrow indicator on the slide directly.\n- Give eye contact to the audience and do not always look at the slides.\n- Do not make the slides too heavy; there is not enough air or imagination.\n- Hapex legomenon to show how complex things are. (only once in each talk)\n\nAn important note to speakers using slides: If the slides are too detailed, no one will listen to them. They'll want to focus on the slides.\n\n### 7. Informing\n\nWhen presenting new ideas or work, focus on the following things:\n\nTalk about the cool things and new ideas that you think of or work on. And show your impact. It should contain both promise and inspiration. \n\n- **Promise**\n\tYou can show promise in a cool way. Use visuals, comparisons to others, or old work to hint at the big impact of your talk. Make it cool! Show that what you’re presenting is valuable and impactful.\n\n- **Inspiration**\n\tWhen someone exhibits a passion for what they are doing, people will get inspired by them.\n\n### 8. How to Think\n\nStory is the key! You have to focus on how to tell a good story.\n\n### 9. Persuading\n\nWhen you have a job talk or want to get famous, it is more or less like persuading other people. Either to hire you or to recognize your contribution.\n\nOne important thing when practicing: Find someone who does not know about what you are doing. And practice with them. Speak clearly. Make it so a novice can understand you.\n\n### 10. Job Talks\n\nThe speaker talks about two important factors that you should mention in your job talks:\n\n- Vision - Explain the problem you’re addressing and your approach to solving it.\n- Done Something - You should mention what steps your approach consists of.\n\nAnd you should talk about those in the first 5 minutes.\nIt will lead to the most important part - \n\tWhat is your **contribution**? \n\tWhat did you do exactly? \n\tWhat have you **achieved**?\n\n### 11. Get Famous\n\nPeople might ask, why is getting famous important? The short answer is that you need to be recognized. This is important because, once others recognize you, they will value your ideas.\n\nAnd how?\n\nHere are the 5 S:\n\n- Symbol - Use a memorable symbol for your work. For example, the speaker uses a star symbol to show this part.\n- Slogan - Create a catchy and concise sentence to summarize your idea.\n- Surprise - Offer a unique or surprising fact or example. One example is enough.\n- Salient - Make sure your work is relevant and stands out.\n- Story - Tell the story behind your work to make it more relatable. How did you do it? How does it work? Why is it important?\n\n### 12. How to Stop\n\n- Final Slide:\n\t- Do not show collaborators - instead, show it in the front.\n\t- Do not show questions.\n\t- Do not show the link to your profile - Nobody actually visits the link to your profile or work, so do not show it.\n\t- DO list your **contributions** - this is what people should remember.\n\n- Final Words:\n\t- Joke - this is an excellent time to tell a joke, so people will think this talk is fun :)\n\t- Better not to use \"thank you\" as the final word; this is too weak.\n\t- Salute - this is good and expresses something like \"It's been great fun here.\"","Metadata":{"Title":"How to Speak","PublishDate":"2024-11-10T00:00:00","Tags":["#softskill"]}}