{"Id":"getting-things-done","Content":"First, I must admit that I easily get overwhelmed when I think of many things I need to do. Just thinking of them makes me anxious, and my brain will keep thinking until I am tired of it. Part of this is because I am always afraid of missing anything important.\n\nBrains are much better at processing information than storing it.\n\nI recently heard about the GTD framework, which stands for \"**Getting Things Down**.\" Developed by productivity consultant David Allen, the GTD framework is a time-management method designed to help individuals organize tasks effectively and reduce stress.\nOnly when you realize how many things you need or want to do are scattered around you do you wish to learn any method to help you tackle a situation like that.\n\n## Detail\n\nIt consists of 5 steps:\n### 1. Capture\n##### Collect what has your attention\n\n**Collect everything:** The idea is to capture the idea with little focus on its format and content. No matter if it's big or small. For example, you realize you must do the tax work at some point. Simply write \"tax\" in your notebook or note application on mobile. If you use Todoist, put it in the inbox. You can fill in the proper content and details in the later steps.\n\n**Use trusted tools:** Write, record, or gather everything that has your attention into a collection tool, such as a notebook, a note application on your mobile device, or a task management app like Todoist.\n\n### 2. Clarify\n##### Process what it means\n\n**Process your inbox:** Here is the time to review the ideas you captured in the first step. Write a meaningful sentence about the task and fill in the details. For example, for the \"tax\" idea, write details like \"Discuss tax documents with Mary\" and attach Mary's contact number. During this step, try also to define the action of each task, whether it needs to be a bigger project or can be a task with several small steps. Process what you have captured into clear and concrete action steps!\n\n**Determine actionability:** Is it actionable? If so, decide the following action and project (if more than one action is required). By 'actionable,' we mean tasks that you can take immediate action on, such as 'reply to an email' or 'make a phone call.' if not, determine if it is trash, reference, or something to put on hold.\n\n### 3. Organize\n##### Put it where it belongs\n\n**Categorize tasks:** Remember to store your categorized content reminders in suitable locations. Now is a great time to organize your tasks. First, assess the task's complexity. If it takes less than two minutes, do it immediately. Otherwise, consider delegating the task to someone else. If the task is no longer actionable, consider deleting it.\n\n**Set context and priorities:** Assign the due date if you need to get this thing done. Attach information or reference material to the task when needed. You can also mark the task with different priorities to help you understand how to plan your time. For example, you can mark a task as 'urgent' if it needs to be done immediately or 'important' if it's a high-priority task.\n\n### 4. Reflect\n##### Review frequently\n\n**Adjust as needed:** Update and review all pertinent system contents to regain control and focus.\nMake a regular plan to review your project and tasks and see if they are still relevant or if the requirements have changed. You can do a small review daily and go through the whole project weekly or bi-weekly to see if you need to adjust anything.\n\n### 5. Engage\n##### Simply do\n\n**Take action and trust your system:** Use your trusted system to make action decisions with confidence and clarity. The project should be full of actionable tasks that are relatively easy to execute. Go to work on the important stuff.\n\n\n## Thoughts\n\nThese steps remind me of the team I worked with and how we plan our sprints. We use JIRA to keep track of all our tasks. (I know everyone hates JIRA)\n\nIn my team, whenever a new task arises, we create a JIRA ticket. Then, we go through them during sprint planning; we prioritize those tasks and estimate and assign them to people. During the regular meeting, we also identify whether those tickets are still relevant or if we need to re-prioritize them. Afterward, we review them and reflect on our performance when the sprint ends. Regular reviews keep us aligned and efficient—much like the GTD method.\n\nWhile the GTD framework wasn’t entirely new to me, formally recognizing and applying it has streamlined how I manage my tasks both professionally and personally. It’s reassuring to have a trusted system that mirrors successful practices in my work environment.\n\nHopefully, adopting the GTD method can reduce anxiety, increase productivity, and ensure nothing important slips through the cracks. It’s a versatile system applicable to any profession or personal endeavor.","Metadata":{"Title":"Getting Things Done","PublishDate":"2024-11-01T00:00:00","Tags":["#softskill"]}}